# ~/.config/homebrew/Brewfile.common - Common macOS packages (managed by chezmoi)
#
# IMPORTANT: Do *NOT* install Node.js or nvm via Homebrew:
# - node: use a Node version manager like nvm.
# - nvm: managing nvm via Homebrew is unsupported.

# --- Brew Formulae (CLI Apps) ---

brew "bash" # Latest Bash version.
brew "bat" # Clone of cat with syntax highlighting and Git integration.
brew "eza" # Modern, maintained replacement for ls.
brew "fd" # Simple, fast and user-friendly alternative to find.
brew "fdupes" # Identify or delete duplicate files.
brew "ffmpeg" # Play, record, convert, and stream audio and video.
brew "fzf" # Command-line fuzzy finder.
brew "gh" # GitHub command-line tool.
brew "git" # Latest Git version.
brew "grep" # Latest Grep version (GNU grep, egrep and fgrep).
brew "imagemagick" # Tools and libraries to manipulate images in many formats.
brew "mackup" # Keep your Mac's application settings in sync.
brew "mas" # Mac App Store command-line interface.
brew "onefetch" # Command-line Git information tool.
brew "svgo" # Nodejs-based tool for optimizing SVG vector graphics files.
brew "tlrc" # Official tldr client written in Rust (tldr: Simplified and community-driven man pages).
brew "tree" # Display directories as trees (with optional color/HTML output).
brew "webp" # Image format providing lossless and lossy compression for web images.
brew "wget" # Successor of GNU Wget, a file and recursive website downloader.
brew "woff2" # Utilities to create and convert Web Open Font File (WOFF) files.
brew "xdg-ninja", args: ["HEAD"] # Check your $HOME for unwanted files and directories.

# --- Brew Casks (GUI Apps + Fonts) ---

cask "1password" # Password manager that keeps all passwords secure behind one password.
cask "1password-cli" # Command-line interface for 1Password.
cask "appcleaner" # Application uninstaller.
cask "colour-contrast-analyser" # Colour contrast checker.
cask "cyberduck" # Server and cloud storage browser.
cask "deepl" # Trains AIs to understand and translate texts.
cask "discord" # Voice and text chat software.
cask "figma" # Collaborative team software.
cask "firefox" # Web browser.
cask "font-asap"
cask "font-asap-condensed"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-inter" # Variable font designed for display.
cask "font-jetbrains-mono" # Typeface made for developers.
cask "font-meslo-for-powerlevel10k" # Monospace font customized for Powerlevel10k.
cask "font-new-york" # Serif font "New York" by Apple.
cask "font-sofia-sans"
cask "font-sofia-sans-condensed"
cask "font-sf-compact" # Compact variant of "San Francisco" by Apple.
cask "font-sf-mono" # Monospaced variant of "San Francisco" by Apple.
cask "font-sf-pro" # Sans-serif variant of "San Francisco" by Apple.
cask "font-source-sans-3"
cask "font-source-serif-4"
cask "google-chrome" # Web browser.
cask "google-chrome@canary" # Web browser.
cask "iina" # Free and open-source media player.
cask "imageoptim" # Tool to optimise images to a smaller size.
cask "inkscape" # Vector graphics editor.
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app.
cask "keka" # File archiver.
cask "kekaexternalhelper" # Helper application for the Keka file archiver.
cask "logi-options+" # Software for Logitech devices.
cask "maccy" # Clipboard manager.
cask "nordvpn" # VPN client for secure internet access and private Browse.
cask "notion" # App to write, plan, collaborate, and get organised.
cask "pika" # Colour picker for colours onscreen.
cask "safari-technology-preview" # Web browser.
cask "slack" # Team communication and collaboration software.
cask "visual-studio-code" # Open-source code editor.
cask "vlc" # Multimedia player.

# --- Mac App Store Apps ---

mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "Color Picker", id: 1545870783
mas "Fonts Ninja", id: 1480227114
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "Linearity Curve", id: 1219074514
mas "Magnet", id: 441258766
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Online Check", id: 6504709660
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "PocketTube", id: 1533703891
mas "Pure Paste", id: 1611378436
mas "Refined GitHub", id: 1519867270
mas "Shazam", id: 897118787
mas "Speediness", id: 1596706466
mas "Super Agent", id: 1568262835
mas "Todoist", id: 585829637
mas "VisBug", id: 1538509686


# ~/.config/homebrew/Brewfile.personal - Personal macOS packages (managed by chezmoi)
#
# IMPORTANT: Do *NOT* install Node.js or nvm via Homebrew:
# - node: use a Node version manager like nvm.
# - nvm: managing nvm via Homebrew is unsupported.

# --- Brew Formulae (CLI Apps) ---

brew "mkvtoolnix" # Matroska media files manipulation tools.

# --- Brew Casks (GUI Apps + Fonts) ---

cask "autofirma" # Digital signature editor and validator.
cask "gog-galaxy" # Game client.
cask "hp-easy-start" # Set up your HP printer.
cask "openemu" # Retro video game emulation.
cask "porting-kit" # Install games and apps compiled for Microsoft Windows.
cask "qbittorrent" # Peer to peer Bitorrent client.


# ~/.config/homebrew/Brewfile.work - Work macOS packages (managed by chezmoi)
#
# IMPORTANT: Do *NOT* install Node.js or nvm via Homebrew:
# - node: use a Node version manager like nvm.
# - nvm: managing nvm via Homebrew is unsupported.

# --- Brew Formulae (CLI Apps) ---

brew "php" # General-purpose scripting language.

# --- Brew Casks (GUI Apps + Fonts) ---

cask "local" # WordPress local development tool by Flywheel.
cask "wordpresscom-studio" # WordPress local development environment.
